/*
Циклы — сложная тема. Новой информации оказалось так много, что у вас никак не получается заснуть. Требуется применить проверенный метод — посчитать овечек.
Напишите цикл, в котором они одна за другой будут прыгать через забор. Вам нужно пересчитать 17 овечек. Тогда вы сможете отдохнуть с чистой совестью.
 */
class Main {
    public static void main(String[] args) {
        // Вместо точек подставьте нужные выражения
        for (int i = -3; i <= 11; i = i + 1) {
            System.out.println("Этаж " + i);
        }
    }
}