class Main {

    public static void main(String[] args) {
        int x = -5;
        boolean isNegative = x > 0;
        // Объявите переменную и сохраните в неё результат сравнения
        // Выведите значение переменной на экран
        System.out.println("Значение переменной isNegative = " + isNegative);
    }
}