/*
🦉 Исправьте текст при помощи методов replace() и replaceFirst(). У вас должно получиться.

На красный свет — стой на месте;
на жёлтый свет — приготовься;
на зелёный — осмотрись, а затем смело шагай.
*/
public class Practicum {
    public static void main(String[] args) {
        String rules = "На зелёный цвет — стой на месте;\n" +
                "на зелёный цвет — приготовься;\n" +
                "на зелёный — осмотрись, а затем смело шагай.";

        String replaced = rules.replace("ц", "с").replaceFirst("зелёный", "красный").replaceFirst("зелёный", "жёлтый");
        System.out.println(replaced);
    }
}