/*
🦉 Объединить элементы массива в строку можно также через StringBuilder с помощью цикла.
Однако код с таким алгоритмом выглядит достаточно громоздко. Исправьте его так, чтобы в использовании
StringBuilder и цикла отпала необходимость.
*/
public class Practicum {
    public static void main(String[] args) {
        String[] rainbow = new String[]{
                "Красный",
                "Оранжевый",
                "Жёлтый",
                "Зелёный",
                "Голубой",
                "Синий",
                "Фиолетовый"
        };

        String sbRainbow = String.join(", ", rainbow);

        System.out.println(sbRainbow);
    }
}