/*
🦉Перед вами хеш-таблица, в которой хранятся названия фильмов и имена режиссёров. Исправьте код таким образом, чтобы ключи выводились на консоль в том же порядке, в каком они были добавлены в хеш-таблицу.
*/
import java.util.LinkedHashMap;

public class Practicum {
    private static LinkedHashMap<String, String> films = new LinkedHashMap<>();

    public static void main(String[] args) {
        films.put("Титаник", "Джеймс Кэмерон");
        films.put("Гарри Поттер и философский камень", "Крис Коламбус");
        films.put("Хакеры", "Иэн Софтли");
        films.put("Терминатор", "Джеймс Кэмерон");

        for (String film : films.keySet()) {
            System.out.println(film);
        }
    }
}