/*
У вас ответственное задание — нужно написать программу для авиакомпании, которая будет распределять пассажиров по местам в самолёте.
Чтобы не усложнять, будем считать, что места идут последовательно: 1, 2, 3, …, 50, 51, 52 и так далее. Заполните хеш-таблицу таким образом, чтобы каждому пассажиру в ней соответствовало его место в самолёте.
*/

import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class Practicum {
    // Пример списка пассажиров (на самом деле их больше)
    private static List<String> passengerNames = List.of(
            "Василий Петров",
            "Анна Ягирская",
            "Виктория Сотова",
            "Игорь Серов",
            "Людмила Ульянова"
    );

    public static void main(String[] args) {
        Map<String, Integer> seats = assignSeats(passengerNames);
        System.out.println("Места пассажиров: " + seats);
    }

    public static Map<String, Integer> assignSeats(List<String> passengerNames) {
        // Тут нужно написать код, который будет распределять места в самолёте ✈️
        Map<String, Integer> passengers = new HashMap<String, Integer>();
        int seat = 1;
        for (String passenger : passengerNames) {
            passengers.put(passenger, seat++);
        }
        return passengers;
    }
}